content/posts/The_information_geometry_of_2-field_functional_integrals_by_Eric_Smith_in_2019.md
+++
title = "The information geometry of 2-field functional integrals by Eric Smith in 2019"
author = ["Cameron Smith"]
lastmod = 2020-09-24T01:48:54-04:00
slug = "The_information_geometry_of_2-field_functional_integrals_by_Eric_Smith_in_2019"
draft = false
+++

## [probabilistic inference]({{< relref "probabilistic_inference" >}}), [path integral]({{< relref "path_integral" >}}), [quantum field theory]({{< relref "quantum_field_theory" >}}), [stochastic processes]({{< relref "stochastic_processes" >}}), [statistical physics]({{< relref "statistical_physics" >}}), [physics]({{< relref "physics" >}}), [papers]({{< relref "papers" >}}), [information geometry]({{< relref "information_geometry" >}}) {#probabilistic-inference--probabilistic-inference-dot-md--path-integral--path-integral-dot-md--quantum-field-theory--quantum-field-theory-dot-md--stochastic-processes--stochastic-processes-dot-md--statistical-physics--statistical-physics-dot-md--physics--physics-dot-md--papers--papers-dot-md--information-geometry--information-geometry-dot-md}


## [pdf on arXiv](<https://arxiv.org/pdf/1906.09312.pdf>) {#pdf-on-arxiv--https-arxiv-dot-org-pdf-1906-dot-09312-dot-pdf}


## outline {#outline}


### I. Understanding the Liouville Theorems that emerge in 2-field functional integrals for dissipative systems {#i-dot-understanding-the-liouville-theorems-that-emerge-in-2-field-functional-integrals-for-dissipative-systems}


### II. The dual geometry from cumulant-generating functions for counts on integer lattices {#ii-dot-the-dual-geometry-from-cumulant-generating-functions-for-counts-on-integer-lattices}

<!--list-separator-->

-  A. The exponential families from generating functions for species counts

<!--list-separator-->

-  B. The Fisher metric on the exponential family of tilted distributions

    <!--list-separator-->

    -  1. The variance as local metric, and the Fisher distance element introduced

    <!--list-separator-->

    -  2. Coordinate dualization, Legendre transform, and the Large-Deviation function

    <!--list-separator-->

    -  3. Exponential families on multinomial distributions

<!--list-separator-->

-  C. The base and the tilt: inner products between vector fields describing two sources of variation

<!--list-separator-->

-  D. Preservation of the inner product in connection with Liouville's theorem


### II. Finite-system models as sample estimators; the Large-deviation function, and importance sampling {#ii-dot-finite-system-models-as-sample-estimators-the-large-deviation-function-and-importance-sampling}

<!--list-separator-->

-  A. States as samples; system scaling and sample aggregation

<!--list-separator-->

-  B. Legendre transform and large deviations in the interpretation of importance sampling


### IV. Doi-Peliti 2-field functional integrals, and dual mappings induced by time translation {#iv-dot-doi-peliti-2-field-functional-integrals-and-dual-mappings-induced-by-time-translation}

<!--list-separator-->

-  A. Time evolution of moment\* and cumulant-generating functions

<!--list-separator-->

-  B. The 2FFI representation of the identity on distributions

    <!--list-separator-->

    -  1. Coherent states and the Peliti construction of the functional integral

    <!--list-separator-->

    -  2. The Peliti functional integral as a statistical model

<!--list-separator-->

-  C. Stationary paths of the 2-field action functional

<!--list-separator-->

-  D. Canonical transformations of the field variables of integration

    <!--list-separator-->

    -  1. An action-angle transform from coherent-state variables to number-potential variables

    <!--list-separator-->

    -  2. Descaling with respect to the instantaneous steady-state mean number

    <!--list-separator-->

    -  3. Time-translation along stationary paths


### V. The Liouville theorem connecting dynamics to inference induced by 2-field stationary trajectories {#v-dot-the-liouville-theorem-connecting-dynamics-to-inference-induced-by-2-field-stationary-trajectories}

<!--list-separator-->

-  A. The Wigner function from the 2-field identity operator plays the role of a phase-space density

<!--list-separator-->

-  B. The Fisher metric and cubic tensor in dual canonical coordinates

<!--list-separator-->

-  C. The dual vector fields induced by base-distribution initial conditions and final-time tilts

    <!--list-separator-->

    -  1. The conserved inner product of dual vector fields, and directional transport of the metric

<!--list-separator-->

-  D. Dual connections respecting the symplectic structure of canonical transformations in the 2-field system

    <!--list-separator-->

    -  1. Conservation of the inner product through the combined effects of two maps

    <!--list-separator-->

    -  2. Referencing arbitrary dual connections to dually flat connections in the exponential family

    <!--list-separator-->

    -  3. Flat connections for coherent-state coordinates

<!--list-separator-->

-  E. On the roles of coherent-state versus number-potential coordinates in the Doi-Peliti representation


### VI. A worked example: The 2-state linear system {#vi-dot-a-worked-example-the-2-state-linear-system}

<!--list-separator-->

-  A. Two-argument and one-argument generating functions on distributions with a conserved quantity

<!--list-separator-->

-  B. Generator and conserved volume element in coherent-state coordinates

    <!--list-separator-->

    -  1. Splitting the symplectic structure between coherent-state conjugate field pairs

    <!--list-separator-->

    -  2. Stationary-path solutions and Liouville volume element

    <!--list-separator-->

    -  3. Invariant cumulant-generating function and the incompressible phase-space density

<!--list-separator-->

-  C. Fisher metric

<!--list-separator-->

-  D. Dual coordinates for base and tilt, and the additive exponential family

<!--list-separator-->

-  E. Why coherent-state fields do not generally produce invertible coordinate transformations

<!--list-separator-->

-  F. Flat transport in the coherent-state connection

    <!--list-separator-->

    -  1. Connection coefficients and absorption of measure terms

    <!--list-separator-->

    -  2. Duality of dynamics and inference in Doi-Peliti theory

<!--list-separator-->

-  G. The Fisher information density and large-deviation ratios as sample estimators


### VII. Conclusions: the duality of dynamics and inference for irreversible and reversible processes {#vii-dot-conclusions-the-duality-of-dynamics-and-inference-for-irreversible-and-reversible-processes}
